class Delivery::GraduationsController < Delivery::DeliveryController
  def kg
    set_meta_tags title: 'Оформление для детей шарами на выпускной в детском саду',
                  description: "\u041F\u0435\u0440\u0432\u044B\u0439 \u0432\u044B\u043F\u0443\u0441\u043A\u043D\u043E\u0439 \u0434\u043E\u043B\u0436\u0435\u043D \u0437\u0430\u043F\u043E\u043C\u043D\u0438\u0442\u044C\u0441\u044F \u0440\u0435\u0431\u0451\u043D\u043A\u0443 \u043D\u0430 \u0432\u0441\u044E \u0436\u0438\u0437\u043D\u044C, \u0434\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0437\u0430\u043A\u0430\u0436\u0438\u0442\u0435 \u043E\u0444\u043E\u0440\u043C\u043B\u0435\u043D\u0438\u0435 \u0432\u043E\u0437\u0434\u0443\u0448\u043D\u044B\u043C\u0438 \u0448\u0430\u0440\u0430\u043C\u0438 \u043D\u0430 \u0432\u044B\u043F\u0443\u0441\u043A\u043D\u043E\u0439 \u0432 \u0428\u0430\u0440\u0438\u043A\u043E\u0432\u043E\u0439 \u0444\u0435\u0435.",
                  keywords: 'оформление шарами выпускной в детском саду,
                              выпускной детский сад шары,
                              украшение шарами на выпускной в детском саду,
                              шары в сад на выпускной,
                              выпускной в саду украшение шарами,
                              украшения шарами на выпускной в детском,
                              украшение зала шарами на выпускной в саду,
                              оформление шарами выпускной в детском,
                              оформление зала шарами на выпускной в детском,
                              оформление выпускного в саду шарами'
  end

  def school
    set_meta_tags title: 'Воздушные шары на выпускной',
                  description: "\u0417\u0430\u043A\u0430\u0437\u0430\u0442\u044C \u043E\u0444\u043E\u0440\u043C\u043B\u0435\u043D\u0438\u0435 \u0448\u0430\u0440\u0430\u043C\u0438 \u0438\u043B\u0438 \u0448\u0430\u0440\u044B \u043D\u0430 \u0437\u0430\u043F\u0443\u0441\u043A \u0432 \u043D\u0435\u0431\u043E \u0441 \u043C\u0435\u0447\u0442\u0430\u043C\u0438 \u0438 \u043F\u043B\u0430\u043D\u0430\u043C\u0438 \u0432\u044B\u043F\u0443\u0441\u043A\u043D\u0438\u043A\u043E\u0432 \u0432\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0432 \u0428\u0430\u0440\u0438\u043A\u043E\u0432\u043E\u0439 \u0444\u0435\u0435.",
                  keywords: 'шары на выпускной
                              украшение шарами на выпускной,
                              оформление шарами выпускной,
                              зал на выпускной шарами,
                              украшение зала шарами на выпускной,
                              воздушные шары на выпускной,
                              оформление выпускного зала шарами'
  end

  def univ; end

  def index; end
end
